In [3]:
import pandas as pd
import acquire
import seaborn as sns
#gonna need pandas, at least

## 1 Use a python module containing datasets as a source from the iris data. 
### Create a pandas dataframe, df_iris, from this data.

In [ ]:
copy_paste_df = pd.read_clipboard()

In [ ]:
copy_paste_df.head()
#This came out weird. I'll just use the db in the mysql server.

In [4]:
iris = sns.load_dataset("iris")

#### print the first 3 rows

In [6]:
iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

#### print the number of rows and columns (shape)

In [10]:
iris.shape
print(f"The dataframe is {iris.shape[0]} rows tall and {iris.shape[1]} columns wide.")

The dataframe is 150 rows tall and 5 columns wide.

#### print the column names

In [11]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

#### print the data type of each column

In [12]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

#### print the summary statistics for each of the numeric variables.

In [13]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

####    Would you recommend rescaling the data based on these statistics?

In [ ]:
#No. They all look to be around the same scale. 0-10.

## 2 Read Table1_CustDetails the excel module dataset, Excel_Exercises.xlsx, into a dataframe, df_excel

In [14]:
excel_df = pd.read_excel('Excel_Exercises.xlsx', index_col=0)

In [16]:
excel_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7049 entries, 0002-ORFBO to 9995-HOTOH
Data columns (total 11 columns):
gender               7049 non-null object
is_senior_citizen    7049 non-null int64
partner              7049 non-null object
dependents           7049 non-null object
phone_service        7049 non-null int64
internet_service     7049 non-null int64
contract_type        7049 non-null int64
payment_type         7049 non-null object
monthly_charges      7049 non-null float64
total_charges        7038 non-null float64
churn                7049 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 660.8+ KB

### assign the first 100 rows to a new dataframe, df_excel_sample

In [18]:
df_excel_sample = excel_df.head(100)

### print the number of rows of your original dataframe

In [22]:
print(f"The original dataframe has {excel_df.shape[0]} rows.")

The original dataframe has 7049 rows.

### print the first 5 column names

In [24]:
excel_df.columns[:5]

Index(['gender', 'is_senior_citizen', 'partner', 'dependents',
       'phone_service'],
      dtype='object')

### print the column names that have a data type of object

In [31]:
excel_df.dtypes[excel_df.dtypes == object]

gender          object
partner         object
dependents      object
payment_type    object
churn           object
dtype: object

### compute the range for each of the numeric variables.

In [38]:
excel_df.dtypes[excel_df.dtypes != object]

is_senior_citizen      int64
phone_service          int64
internet_service       int64
contract_type          int64
monthly_charges      float64
total_charges        float64
dtype: object

In [40]:
excel_df.monthly_charges.max() - excel_df.monthly_charges.min()

100.5

In [42]:
excel_df.total_charges.max() - excel_df.total_charges.min()

8666.0

## 3 Read the data from this google sheet into a dataframe, df_google

In [32]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_googlesheet = pd.read_csv(csv_export_url)

### print the first 3 rows

In [33]:
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

### print the number of rows and columns

In [34]:
df_googlesheet.shape

(891, 12)

### print the column names

In [35]:
df_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### print the data type of each column

In [36]:
df_googlesheet.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### print the summary statistics for each of the numeric variables

In [37]:
df_googlesheet.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### print the unique values for each of your categorical variables